{
  "namespace": "owuikernel_config",
  "configuration": { "type": "panel", "$key": "WWtkR00ySnRNWFprTWxaNVlrYzVjdz09", "$ver": "1.0",
  
  // - ► Information about this file. -
  
  // This is configuration file, allowing you to modify
  // any necessary feature as you wish. everytime you've
  // launched the game along with ui loaded, the config will
  // load and mark as default configuration file and will
  // remain the same until you edit it. - in short, your's
  // personal config setting.
  
  // Why not global variables? - in short, not for everyone.
  // configuration file was created just for people
  // who doesn't know how to edit stuff properly.
  
  // Each variables has available values for you
  // to modify and enable features by default, changing
  // invalid values can result unintentional issues, bugs,
  // performance issues, crashes, and possibly break the UI.
  
  // There is few calegory that allows easy modification and
  // without any impact after breaking UI, if you feel that
  // config you've changed aren't perfect and wants to go
  // back where its original configuration, you can manually 
  // set every existing config to default value. or better if
  // you make copy of this file before editing in-case some
  // serious problems.
  
  // ----------------------------------
  
  // Common sense before getting started on editing 
  // the existing configuration.
  
  // Always check the JSON (or JSONC) syntax before applying, 
  // there's any website that'll check for you, and should
  // learn some JSON basic stuff first, like. string and etc.
  // This isn't just help for this single file, but it'll help
  // you through many add-on's calagory since every addons is
  // is based JSON's data driven, and that's also the case of
  // this UI.
  
  // You can delete all of the existing comments on this file,
  // if you find it annoying. but DO NOT DELETE NON-COMMENTS
  // OTHERWISE THE FALLBACK CONFIG WILL BE ENABLED, THIS MAKES
  // THE CONFIGURATION FILE UTTERLY USELESS AND WON'T APPLY TO
  // OVERWHELM UI.
  
  // Configuration is essentially a key for editing features
  // and applying upon game launchs or re-joining worlds and
  // servers. this specially is done because you can't save
  // Custom UI's data, of keeping as database. everytime you
  // restart the game or re-joining world, the settings you've
  // saved will be reset to default configuration. this is the
  // case with every UI's packs around the internet.
  
  // Configuration file allows to be shared, and use preferred
  // peoples choices. making customization kinda limitlessness
  //
  
  // Symbols of configs what you should modify etc.
  
  // "*" - Can cause issues such as pink/black texture nor
  //       invisible textures.
  //       ( No fallback trigger. )
  
  // "**" - Config settings that required other settings order
  //        to function well. Otherwise it won't simply work
  //        ( No fallback trigger. )
  
  // "***" - Outside resources, meaning sharing the config file
  //         will require users to download the necessary
  //         contents order to make the config/preset works as
  //         uploader desired.
  //         ( No fallback trigger. )
  
  // "[!]" - Notices, important messages for some config.
  
  // "{<String>}" - The config actual setting path.
  
  // "(!)" - Critical, can cause issues between UI and config.
  //         This may conflicts another, so the fallback will
  //         do their work.
  
  // "(!!)" - Dangerous, Will result the config to forcely use
  //          fallback config order to prevent game crashes.
  
  // • Author - HarlowAether
  // • File Date - Oct 12, 2022 ( Original - Oct 1, 2022 )
  
  // ----------------------------------
  
  /* [ Critical ]
   * This is most critical config that it should be default
   * various, changing to invaild values will result config
   * unable to work and triggers the kernel fallback config.
   * Fallback config will set everything to default upon booting
   * the game up and refusing to read config. therefore
   * **the configuration file is utter useless.**
   *
   * Be cautious with what you've doing.
  */
    "$configname": "Default",
      // Your personal configuration name.
      // it doesn't matter if the name is default or not.
      // No any errors will occur.
      // Perhaps there's might be, "easter egg" if you know me
      // well on bedrock addon's discord or another servers.
    
    "$fallback": false,
      // If you aren't happy with what you have and doesn't
      // have backup config file, messed up file, and too lazy?
      // Fear not, fallback is a default configuration rollback.
      // This will replace every config into default as long the
      // value is true. Fallback will automatically on when the
      // config file is missing and lost.
      //
      // Be warned - It's a temporary config or safemode config.
      // You won't able to set any configuration for default
      // unless you have the vaild configuration file.
      
  // ----------------------------------
    /* [ Common ]
     * 
     * Regular configuration without any performance impact.
    */
  // ----------------------------------
  
    "$example": false,
    /* - Examples -
       first and usable config testing. it does absolute nothing upon enabling.
       Because it used to deter whenever that work or not.
    */
    
    "$is_debug": false, // [ false ]
    /* - Debug mode -
       Displays "java edition"-ish debug screen for each individual screen 
       that present with modified UI. the use of this is to debugging such as
       configuration lists, verification, correct menu display,
       fallback detector, and so on.
    */
    
    "$classic_mode": false, // [ false ]
    /* - Classic LynxsiumUI -
       OverwhelmUI was supposedly an installment to LynxsiumUI, one of my lost
       project out there. enabling this option will enable the classic layouts
       and its visuals identical to LynxsiumUI.
       
       ** Not implemented yet
       [!] Be warned that any customization won't work.
    */
    "$is_lite_mode": false, // [ false ]
    /* - Lite mode -
       Improvements to performance, disabling almost every unnecessary visuals.
       allowing more optimization, performance and less intensive for 
       low-end devices.
       
       [!] If the lagging issues still present, consider
           using "No config" subpack instead.
    */
    
  // ----------------------------------
    /* [ Appearance ]
     * 
     * Changes how menu looks and its vibes, with the cost of performance.
    */
  // ----------------------------------
  
    "$menu_background": false, // [ false ]
    /* - Menu Background (BG) -
       essentially displays background image in outgame, such as
       start screen, settings, world menu, and etc.
       
       [!] Performance may impact in low-end devices,
           disabling this may dramatically improves it.
           However, depends on background scales. the larger image
           is, the more performance sinking.
    */
    
    "$custom_bg_path": "", // [ "" ]
    /* - Custom background path -
       Use your own image for Menu background, like above option said.
       "depends on background scales, the larger image is, the more
       performance sinking." Be warned.
       
       Examples - "my_image" | Your image in pack folder.
                  "textures/my_image" | image inside "textures" folder
                  "textures/ui/my_image" | image inside "ui" texture folder
                  "" | disables custom image path.
       
       [!] May requires "non-source" version of this UI to use it.
           Or you can delete "content.json" in the pack order
           to use this feature.
           
       [**] "$menu_background" is required to function.
    */
    
    "$custom_bgblur_path": "", // [ "" ]
    /* - Custom background blur path -
       Like above said, but this one for blur background. may able to see in
       world menu, settings and etc.
       
       Examples - "my_image" | Your image in pack folder.
                  "textures/my_image" | image inside "textures" folder
                  "textures/ui/my_image" | image inside "ui" texture folder
                  "" | disables custom image path.
       
       [!] Will double performance impact with depends image scales.
       
       [**] "$menu_background" is required to function.
    */
    
    "$xbox_nametag_display": true, // [ true ]
    /* - Xbox nametag display -
       Enables your current xbox nametag display on start screen and
       pause screen. if you wanted to stay more private.
    */
    
    "$dark_appearance": false // [ false ]
    /* - UI Dark Appearance -
       Enables dark visuals, allowing user to see dark contents fairly usable.
       This will change a text with black background into text with underline,
       Bottom bar will turn from white to black, and various visuals
       improvement and enhancement for dark appearance.
       
       ** Not implemented yet
       [!] Menu (and blur) background will be unaffected, this option is only
           for UI appearance. Use "Custom background path" for your own.
           *Overwhelm does not has its own dark menu background.*
    */
}